STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_cm33.h
#define SAI1_Block_A                SAI1_Block_A_S
#define SAI1_Block_A_BASE           SAI1_Block_A_BASE_S

#define SAI1_Block_B                SAI1_Block_B_S
#define SAI1_Block_B_BASE           SAI1_Block_B_BASE_S

#define SAI2                        SAI2_S
#define SAI2_BASE                   SAI2_BASE_S

#define SAI2_Block_A                SAI2_Block_A_S
#define SAI2_Block_A_BASE           SAI2_Block_A_BASE_S

#define SAI2_Block_B                SAI2_Block_B_S
#define SAI2_Block_B_BASE           SAI2_Block_B_BASE_S

#define SAI3                        SAI3_S
#define SAI3_BASE                   SAI3_BASE_S

#define SAI3_Block_A                SAI3_Block_A_S
#define SAI3_Block_A_BASE           SAI3_Block_A_BASE_S

#define SAI3_Block_B                SAI3_Block_B_S
#define SAI3_Block_B_BASE           SAI3_Block_B_BASE_S

#define FDCAN1                      FDCAN1_S
#define FDCAN1_BASE                 FDCAN1_BASE_S

#define FDCAN2                      FDCAN2_S
#define FDCAN2_BASE                 FDCAN2_BASE_S


#define FDCAN_CCU                   FDCAN_CCU_S
#define FDCAN_CCU_BASE              CANCU_BASE_S

#define USART1                      USART1_S
#define USART1_BASE                 USART1_BASE_S

#define SAI4                        SAI4_S
#define SAI4_BASE                   SAI4_BASE_S

#define SAI4_Block_A                SAI4_Block_A_S
#define SAI4_Block_A_BASE           SAI4_Block_A_BASE_S

#define SAI4_Block_B                SAI4_Block_B_S
#define SAI4_Block_B_BASE           SAI4_Block_B_BASE_S


#define UART7                       UART7_S
#define UART7_BASE                  UART7_BASE_S


/*!< AHB2 peripherals defaults to Secure aliases */
#define HPDMA1                      HPDMA1_S
#define HPDMA1_BASE                 HPDMA1_BASE_S

#define HPDMA2                      HPDMA2_S
#define HPDMA2_BASE                 HPDMA2_BASE_S

#define HPDMA3                      HPDMA3_S
#define HPDMA3_BASE                 HPDMA3_BASE_S

#define OCTOSPI1                    OCTOSPI1_S
#define OCTOSPI1_BASE               OCTOSPI1_BASE_S

#define OCTOSPI2                    OCTOSPI2_S
#define OCTOSPI2_BASE               OCTOSPI2_BASE_S
#define OTFDEC1                     OTFDEC1_S
#define OTFDEC1_BASE                OTFDEC1_BASE_S

#define OTFDEC1_REGION1             OTFDEC1_REGION1_S
#define OTFDEC1_REGION1_BASE        OTFDEC1_REGION1_BASE_S

#define OTFDEC1_REGION2             OTFDEC1_REGION2_S
#define OTFDEC1_REGION2_BASE        OTFDEC1_REGION2_BASE_S

#define OTFDEC1_REGION3             OTFDEC1_REGION3_S
#define OTFDEC1_REGION3_BASE        OTFDEC1_REGION3_BASE_S

#define OTFDEC1_REGION4             OTFDEC1_REGION4_S
#define OTFDEC1_REGION4_BASE        OTFDEC1_REGION4_BASE_S

#define OTFDEC2                     OTFDEC2_S
#define OTFDEC2_BASE                OTFDEC2_BASE_S

#define OTFDEC2_REGION1             OTFDEC2_REGION1_S
#define OTFDEC2_REGION1_BASE        OTFDEC2_REGION1_BASE_S

#define OTFDEC2_REGION2             OTFDEC2_REGION2_S
#define OTFDEC2_REGION2_BASE        OTFDEC2_REGION2_BASE_S

#define OTFDEC2_REGION3             OTFDEC2_REGION3_S
#define OTFDEC2_REGION3_BASE        OTFDEC2_REGION3_BASE_S

#define OTFDEC2_REGION4             OTFDEC2_REGION4_S
#define OTFDEC2_REGION4_BASE        OTFDEC2_REGION4_BASE_S
#define ICACHE                      ICACHE_S
#define ICACHE_BASE                 ICACHE_BASE_S

#define DCACHE                      DCACHE_S
#define DCACHE_BASE                 DCACHE_BASE_S

#define IPCC1                       IPCC1_S
#define IPCC1_BASE                  IPCC1_BASE_S

#define IPCC1_C1                    IPCC1_C1_S
#define IPCC1_C1_BASE               IPCC1_C1_BASE_S

#define IPCC1_C2                    IPCC1_C2_S
#define IPCC1_C2_BASE               IPCC1_C2_BASE_S

#define DCMI                        DCMI_S
#define DCMI_BASE                   DCMI_BASE_S

#define PSSI                        PSSI_S
#define PSSI_BASE                   PSSI_BASE_S

#define CRC                         CRC_S
#define CRC_BASE                    CRC_BASE_S

#define MDF1                        MDF1_S
#define MDF1_BASE                   MDF1_BASE_S

#define MDF1_Filter0                MDF1_Filter0_S
#define MDF1_Filter0_BASE           MDF1_Filter0_BASE_S

#define MDF1_Filter1                MDF1_Filter1_S
#define MDF1_Filter1_BASE           MDF1_Filter1_BASE_S

#define MDF1_Filter2                MDF1_Filter2_S
#define MDF1_Filter2_BASE           MDF1_Filter2_BASE_S

#define MDF1_Filter3                MDF1_Filter3_S
#define MDF1_Filter3_BASE           MDF1_Filter3_BASE_S

#define MDF1_Filter4                MDF1_Filter4_S
#define MDF1_Filter4_BASE           MDF1_Filter4_BASE_S

#define MDF1_Filter5                MDF1_Filter5_S
#define MDF1_Filter5_BASE           MDF1_Filter5_BASE_S

#define MDF1_Filter6                MDF1_Filter6_S
#define MDF1_Filter6_BASE           MDF1_Filter6_BASE_S

#define MDF1_Filter7                MDF1_Filter7_S
#define MDF1_Filter7_BASE           MDF1_Filter7_BASE_S

#define ADC1                        ADC1_S
#define ADC1_BASE                   ADC1_BASE_S

#define ADC2                        ADC2_S
#define ADC2_BASE                   ADC2_BASE_S

#define ADC12_COMMON                ADC12_COMMON_S
#define ADC12_COMMON_BASE           ADC12_COMMON_BASE_S

#define ADC3                        ADC3_S
#define ADC3_BASE                   ADC3_BASE_S

#define ADC3_COMMON                 ADC3_COMMON_S
#define ADC3_COMMON_BASE            ADC3_COMMON_BASE_S

#define OCTOSPIM                    OCTOSPIM_S
#define OCTOSPIM_BASE               OCTOSPIM_BASE_S

#define HPDMA1_Channel0             HPDMA1_Channel0_S
#define HPDMA1_Channel0_BASE        HPDMA1_Channel0_BASE_S

#define HPDMA1_Channel1             HPDMA1_Channel1_S
#define HPDMA1_Channel1_BASE        HPDMA1_Channel1_BASE_S

#define HPDMA1_Channel2             HPDMA1_Channel2_S
#define HPDMA1_Channel2_BASE        HPDMA1_Channel2_BASE_S

#define HPDMA1_Channel3             HPDMA1_Channel3_S
#define HPDMA1_Channel3_BASE        HPDMA1_Channel3_BASE_S

#define HPDMA1_Channel4             HPDMA1_Channel4_S
#define HPDMA1_Channel4_BASE        HPDMA1_Channel4_BASE_S

#define HPDMA1_Channel5             HPDMA1_Channel5_S
#define HPDMA1_Channel5_BASE        HPDMA1_Channel5_BASE_S

#define HPDMA1_Channel6             HPDMA1_Channel6_S
#define HPDMA1_Channel6_BASE        HPDMA1_Channel6_BASE_S

#define HPDMA1_Channel7             HPDMA1_Channel7_S
#define HPDMA1_Channel7_BASE        HPDMA1_Channel7_BASE_S

#define HPDMA1_Channel8             HPDMA1_Channel8_S
#define HPDMA1_Channel8_BASE        HPDMA1_Channel8_BASE_S

#define HPDMA1_Channel9             HPDMA1_Channel9_S
#define HPDMA1_Channel9_BASE        HPDMA1_Channel9_BASE_S

#define HPDMA1_Channel10            HPDMA1_Channel10_S
#define HPDMA1_Channel10_BASE       HPDMA1_Channel10_BASE_S

#define HPDMA1_Channel11            HPDMA1_Channel11_S
#define HPDMA1_Channel11_BASE       HPDMA1_Channel11_BASE_S

#define HPDMA1_Channel12            HPDMA1_Channel12_S
#define HPDMA1_Channel12_BASE       HPDMA1_Channel12_BASE_S

#define HPDMA1_Channel13            HPDMA1_Channel13_S
#define HPDMA1_Channel13_BASE       HPDMA1_Channel13_BASE_S

#define HPDMA1_Channel14            HPDMA1_Channel14_S
#define HPDMA1_Channel14_BASE       HPDMA1_Channel14_BASE_S

#define HPDMA1_Channel15            HPDMA1_Channel15_S
#define HPDMA1_Channel15_BASE       HPDMA1_Channel15_BASE_S

#define HPDMA2_Channel0             HPDMA2_Channel0_S
#define HPDMA2_Channel0_BASE        HPDMA2_Channel0_BASE_S

#define HPDMA2_Channel1             HPDMA2_Channel1_S
#define HPDMA2_Channel1_BASE        HPDMA2_Channel1_BASE_S

#define HPDMA2_Channel2             HPDMA2_Channel2_S
#define HPDMA2_Channel2_BASE        HPDMA2_Channel2_BASE_S

#define HPDMA2_Channel3             HPDMA2_Channel3_S
#define HPDMA2_Channel3_BASE        HPDMA2_Channel3_BASE_S

#define HPDMA2_Channel4             HPDMA2_Channel4_S
#define HPDMA2_Channel4_BASE        HPDMA2_Channel4_BASE_S

#define HPDMA2_Channel5             HPDMA2_Channel5_S
#define HPDMA2_Channel5_BASE        HPDMA2_Channel5_BASE_S

#define HPDMA2_Channel6             HPDMA2_Channel6_S
#define HPDMA2_Channel6_BASE        HPDMA2_Channel6_BASE_S

#define HPDMA2_Channel7             HPDMA2_Channel7_S
#define HPDMA2_Channel7_BASE        HPDMA2_Channel7_BASE_S

#define HPDMA2_Channel8             HPDMA2_Channel8_S
#define HPDMA2_Channel8_BASE        HPDMA2_Channel8_BASE_S

#define HPDMA2_Channel9             HPDMA2_Channel9_S
#define HPDMA2_Channel9_BASE        HPDMA2_Channel9_BASE_S

#define HPDMA2_Channel10            HPDMA2_Channel10_S
#define HPDMA2_Channel10_BASE       HPDMA2_Channel10_BASE_S

#define HPDMA2_Channel11            HPDMA2_Channel11_S
#define HPDMA2_Channel11_BASE       HPDMA2_Channel11_BASE_S

#define HPDMA2_Channel12            HPDMA2_Channel12_S
#define HPDMA2_Channel12_BASE       HPDMA2_Channel12_BASE_S

#define HPDMA2_Channel13            HPDMA2_Channel13_S
#define HPDMA2_Channel13_BASE       HPDMA2_Channel13_BASE_S

#define HPDMA2_Channel14            HPDMA2_Channel14_S
#define HPDMA2_Channel14_BASE       HPDMA2_Channel14_BASE_S

#define HPDMA2_Channel15            HPDMA2_Channel15_S
#define HPDMA2_Channel15_BASE       HPDMA2_Channel15_BASE_S

#define HPDMA3_Channel0             HPDMA3_Channel0_S
#define HPDMA3_Channel0_BASE        HPDMA3_Channel0_BASE_S

#define HPDMA3_Channel1             HPDMA3_Channel1_S
#define HPDMA3_Channel1_BASE        HPDMA3_Channel1_BASE_S

#define HPDMA3_Channel2             HPDMA3_Channel2_S
#define HPDMA3_Channel2_BASE        HPDMA3_Channel2_BASE_S

#define HPDMA3_Channel3             HPDMA3_Channel3_S
#define HPDMA3_Channel3_BASE        HPDMA3_Channel3_BASE_S

#define HPDMA3_Channel4             HPDMA3_Channel4_S
#define HPDMA3_Channel4_BASE        HPDMA3_Channel4_BASE_S

#define HPDMA3_Channel5             HPDMA3_Channel5_S
#define HPDMA3_Channel5_BASE        HPDMA3_Channel5_BASE_S

#define HPDMA3_Channel6             HPDMA3_Channel6_S
#define HPDMA3_Channel6_BASE        HPDMA3_Channel6_BASE_S

#define HPDMA3_Channel7             HPDMA3_Channel7_S
#define HPDMA3_Channel7_BASE        HPDMA3_Channel7_BASE_S

#define HPDMA3_Channel8             HPDMA3_Channel8_S
#define HPDMA3_Channel8_BASE        HPDMA3_Channel8_BASE_S

#define HPDMA3_Channel9             HPDMA3_Channel9_S
#define HPDMA3_Channel9_BASE        HPDMA3_Channel9_BASE_S

#define HPDMA3_Channel10            HPDMA3_Channel10_S
#define HPDMA3_Channel10_BASE       HPDMA3_Channel10_BASE_S

#define HPDMA3_Channel11            HPDMA3_Channel11_S
#define HPDMA3_Channel11_BASE       HPDMA3_Channel11_BASE_S

#define HPDMA3_Channel12            HPDMA3_Channel12_S
#define HPDMA3_Channel12_BASE       HPDMA3_Channel12_BASE_S

#define HPDMA3_Channel13            HPDMA3_Channel13_S
#define HPDMA3_Channel13_BASE       HPDMA3_Channel13_BASE_S

#define HPDMA3_Channel14            HPDMA3_Channel14_S
#define HPDMA3_Channel14_BASE       HPDMA3_Channel14_BASE_S

#define HPDMA3_Channel15            HPDMA3_Channel15_S
#define HPDMA3_Channel15_BASE       HPDMA3_Channel15_BASE_S

/*!< AHB3 peripherals defaults to Secure aliases */
#define HASH                        HASH_S
#define HASH_BASE                   HASH_BASE_S

#define HASH_DIGEST                 HASH_DIGEST_S
#define HASH_DIGEST_BASE            HASH_DIGEST_BASE_S

#define RNG                         RNG_S
#define RNG_BASE                    RNG_BASE_S

#define CRYP1                       CRYP1_S
#define CRYP1_BASE                  CRYP1_BASE_S

#define CRYP2                       CRYP2_S
#define CRYP2_BASE                  CRYP2_BASE_S

#define SAES                        SAES_S
#define SAES_BASE                   SAES_BASE_S

#define PKA                         PKA_S
#define PKA_BASE                    PKA_BASE_S

#define RAMCFG                      RAMCFG_S
#define RAMCFG_BASE                 RAMCFG_BASE_S

