STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_cm33.h
/*******************  Bit definition for HDP_MUX register  ********************/
#define HDP_MUX_MUX0_Pos          (0U)
#define HDP_MUX_MUX0_Msk          (0xFUL << HDP_MUX_MUX0_Pos)                /*!< 0x0000000F */
#define HDP_MUX_MUX0              HDP_MUX_MUX0_Msk                          /*!< Select the HDP0 output among the 16 available signals */
#define HDP_MUX_MUX0_0            (0x1UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000001 */
#define HDP_MUX_MUX0_1            (0x2UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000002 */
#define HDP_MUX_MUX0_2            (0x4UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000004 */
#define HDP_MUX_MUX0_3            (0x8UL << HDP_MUX_MUX0_Pos)                /*!< 0x00000008 */
#define HDP_MUX_MUX1_Pos          (4U)
#define HDP_MUX_MUX1_Msk          (0xFUL << HDP_MUX_MUX1_Pos)                /*!< 0x000000F0 */
#define HDP_MUX_MUX1              HDP_MUX_MUX1_Msk                          /*!< Select the HDP1 output among the 16 available signals */
#define HDP_MUX_MUX1_0            (0x1UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000010 */
#define HDP_MUX_MUX1_1            (0x2UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000020 */
#define HDP_MUX_MUX1_2            (0x4UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000040 */
#define HDP_MUX_MUX1_3            (0x8UL << HDP_MUX_MUX1_Pos)                /*!< 0x00000080 */
#define HDP_MUX_MUX2_Pos          (8U)
#define HDP_MUX_MUX2_Msk          (0xFUL << HDP_MUX_MUX2_Pos)                /*!< 0x00000F00 */
#define HDP_MUX_MUX2              HDP_MUX_MUX2_Msk                          /*!< Select the HDP2 output among the 16 available signals */
#define HDP_MUX_MUX2_0            (0x1UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000100 */
#define HDP_MUX_MUX2_1            (0x2UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000200 */
#define HDP_MUX_MUX2_2            (0x4UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000400 */
#define HDP_MUX_MUX2_3            (0x8UL << HDP_MUX_MUX2_Pos)                /*!< 0x00000800 */
#define HDP_MUX_MUX3_Pos          (12U)
#define HDP_MUX_MUX3_Msk          (0xFUL << HDP_MUX_MUX3_Pos)                /*!< 0x0000F000 */
#define HDP_MUX_MUX3              HDP_MUX_MUX3_Msk                          /*!< Select the HDP3 output among the 16 available signals */
#define HDP_MUX_MUX3_0            (0x1UL << HDP_MUX_MUX3_Pos)                /*!< 0x00001000 */
#define HDP_MUX_MUX3_1            (0x2UL << HDP_MUX_MUX3_Pos)                /*!< 0x00002000 */
#define HDP_MUX_MUX3_2            (0x4UL << HDP_MUX_MUX3_Pos)                /*!< 0x00004000 */
#define HDP_MUX_MUX3_3            (0x8UL << HDP_MUX_MUX3_Pos)                /*!< 0x00008000 */
#define HDP_MUX_MUX4_Pos          (16U)
#define HDP_MUX_MUX4_Msk          (0xFUL << HDP_MUX_MUX4_Pos)                /*!< 0x000F0000 */
#define HDP_MUX_MUX4              HDP_MUX_MUX4_Msk                          /*!< Select the HDP4 output among the 16 available signals */
#define HDP_MUX_MUX4_0            (0x1UL << HDP_MUX_MUX4_Pos)                /*!< 0x00010000 */
#define HDP_MUX_MUX4_1            (0x2UL << HDP_MUX_MUX4_Pos)                /*!< 0x00020000 */
#define HDP_MUX_MUX4_2            (0x4UL << HDP_MUX_MUX4_Pos)                /*!< 0x00040000 */
#define HDP_MUX_MUX4_3            (0x8UL << HDP_MUX_MUX4_Pos)                /*!< 0x00080000 */
#define HDP_MUX_MUX5_Pos          (20U)
#define HDP_MUX_MUX5_Msk          (0xFUL << HDP_MUX_MUX5_Pos)                /*!< 0x00F00000 */
#define HDP_MUX_MUX5              HDP_MUX_MUX5_Msk                          /*!< Select the HDP5 output among the 16 available signals */
#define HDP_MUX_MUX5_0            (0x1UL << HDP_MUX_MUX5_Pos)                /*!< 0x00100000 */
#define HDP_MUX_MUX5_1            (0x2UL << HDP_MUX_MUX5_Pos)                /*!< 0x00200000 */
#define HDP_MUX_MUX5_2            (0x4UL << HDP_MUX_MUX5_Pos)                /*!< 0x00400000 */
#define HDP_MUX_MUX5_3            (0x8UL << HDP_MUX_MUX5_Pos)                /*!< 0x00800000 */
#define HDP_MUX_MUX6_Pos          (24U)
#define HDP_MUX_MUX6_Msk          (0xFUL << HDP_MUX_MUX6_Pos)                /*!< 0x0F000000 */
#define HDP_MUX_MUX6              HDP_MUX_MUX6_Msk                          /*!< Select the HDP6 output among the 16 available signals */
#define HDP_MUX_MUX6_0            (0x1UL << HDP_MUX_MUX6_Pos)                /*!< 0x01000000 */
#define HDP_MUX_MUX6_1            (0x2UL << HDP_MUX_MUX6_Pos)                /*!< 0x02000000 */
#define HDP_MUX_MUX6_2            (0x4UL << HDP_MUX_MUX6_Pos)                /*!< 0x04000000 */
#define HDP_MUX_MUX6_3            (0x8UL << HDP_MUX_MUX6_Pos)                /*!< 0x08000000 */
#define HDP_MUX_MUX7_Pos          (28U)
#define HDP_MUX_MUX7_Msk          (0xFUL << HDP_MUX_MUX7_Pos)                /*!< 0xF0000000 */
#define HDP_MUX_MUX7              HDP_MUX_MUX7_Msk                          /*!< Select the HDP7 output among the 16 available signals */
#define HDP_MUX_MUX7_0            (0x1UL << HDP_MUX_MUX7_Pos)                /*!< 0x10000000 */
#define HDP_MUX_MUX7_1            (0x2UL << HDP_MUX_MUX7_Pos)                /*!< 0x20000000 */
#define HDP_MUX_MUX7_2            (0x4UL << HDP_MUX_MUX7_Pos)                /*!< 0x40000000 */
#define HDP_MUX_MUX7_3            (0x8UL << HDP_MUX_MUX7_Pos)                /*!< 0x80000000 */

/*******************  Bit definition for HDP_VAL register  ********************/
#define HDP_VAL_HDPVAL_Pos          (0U)
#define HDP_VAL_HDPVAL_Msk          (0xFFUL << HDP_VAL_HDPVAL_Pos)           /*!< 0x000000FF */
#define HDP_VAL_HDPVAL              HDP_VAL_HDPVAL_Msk                      /*!< Value of the HDP signals */

/******************  Bit definition for HDP_GPOSET register  ******************/
#define HDP_GPOSET_HDPGPOSET_Pos    (0U)
#define HDP_GPOSET_HDPGPOSET_Msk    (0xFFUL << HDP_GPOSET_HDPGPOSET_Pos)     /*!< 0x000000FF */
#define HDP_GPOSET_HDPGPOSET        HDP_GPOSET_HDPGPOSET_Msk                /*!< When a bit is written to 1, the corresponding HDP GPO is set */

/******************  Bit definition for HDP_GPOCLR register  ******************/
#define HDP_GPOCLR_HDPGPOCLR_Pos    (0U)
#define HDP_GPOCLR_HDPGPOCLR_Msk    (0xFFUL << HDP_GPOCLR_HDPGPOCLR_Pos)     /*!< 0x000000FF */
#define HDP_GPOCLR_HDPGPOCLR        HDP_GPOCLR_HDPGPOCLR_Msk                /*!< When a bit is written to 1, the corresponding HDP GPO is cleared */

/******************  Bit definition for HDP_GPOVAL register  ******************/
#define HDP_GPOVAL_HDPGPOVAL_Pos    (0U)
#define HDP_GPOVAL_HDPGPOVAL_Msk    (0xFFUL << HDP_GPOVAL_HDPGPOVAL_Pos)     /*!< 0x000000FF */
#define HDP_GPOVAL_HDPGPOVAL        HDP_GPOVAL_HDPGPOVAL_Msk                /*!< When written, define the value of the HDP GPO */

/*******************  Bit definition for HDP_VERR register  *******************/
#define HDP_VERR_MINREV_Pos         (0U)
#define HDP_VERR_MINREV_Msk         (0xFUL << HDP_VERR_MINREV_Pos)           /*!< 0x0000000F */
#define HDP_VERR_MINREV             HDP_VERR_MINREV_Msk                     /*!< HDP minor revision */
#define HDP_VERR_MAJREV_Pos         (4U)
#define HDP_VERR_MAJREV_Msk         (0xFUL << HDP_VERR_MAJREV_Pos)           /*!< 0x000000F0 */
#define HDP_VERR_MAJREV             HDP_VERR_MAJREV_Msk                     /*!< HDP major revision */

/******************  Bit definition for HDP_IPIDR register  *******************/
#define HDP_IPIDR_ID_Pos            (0U)
#define HDP_IPIDR_ID_Msk            (0xFFFFFFFFUL << HDP_IPIDR_ID_Pos)        /*!< 0xFFFFFFFF */
#define HDP_IPIDR_ID                HDP_IPIDR_ID_Msk                         /*!< HDP identifier */

/*******************  Bit definition for HDP_SIDR register  *******************/
#define HDP_SIDR_SID_Pos            (0U)
#define HDP_SIDR_SID_Msk            (0xFFFFFFFFUL << HDP_SIDR_SID_Pos)        /*!< 0xFFFFFFFF */
#define HDP_SIDR_SID                HDP_SIDR_SID_Msk                         /*!< Size identifier */

/******************************************************************************/
/*                                                                            */
/*                            HW Semaphore (HSEM)                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for HSEM_R register  *********************/
#define HSEM_R_PROCID_Pos               (0U)
#define HSEM_R_PROCID_Msk               (0xFFUL << HSEM_R_PROCID_Pos)              /*!< 0x000000FF */
#define HSEM_R_PROCID                   HSEM_R_PROCID_Msk                         /*!< Semaphore PROCID. */
#define HSEM_R_LOCKID_Pos               (8U)
#define HSEM_R_LOCKID_Msk               (0xFUL << HSEM_R_LOCKID_Pos)               /*!< 0x00000F00 */
#define HSEM_R_LOCKID                   HSEM_R_LOCKID_Msk                         /*!< Semaphore LOCKID. */
#define HSEM_R_SEC_Pos                  (12U)
#define HSEM_R_SEC_Msk                  (0x1UL << HSEM_R_SEC_Pos)                  /*!< 0x00001000 */
#define HSEM_R_SEC                      HSEM_R_SEC_Msk                            /*!< Semaphore secure. */
#define HSEM_R_PRIV_Pos                 (13U)
#define HSEM_R_PRIV_Msk                 (0x1UL << HSEM_R_PRIV_Pos)                 /*!< 0x00002000 */
#define HSEM_R_PRIV                     HSEM_R_PRIV_Msk                           /*!< Semaphore privilege. */
#define HSEM_R_CFEN_Pos                 (30U)
#define HSEM_R_CFEN_Msk                 (0x1UL << HSEM_R_CFEN_Pos)                 /*!< 0x40000000 */
#define HSEM_R_CFEN                     HSEM_R_CFEN_Msk                           /*!< Semaphore CID filter indication. */
#define HSEM_R_LOCK_Pos                 (31U)
#define HSEM_R_LOCK_Msk                 (0x1UL << HSEM_R_LOCK_Pos)                 /*!< 0x80000000 */
#define HSEM_R_LOCK                     HSEM_R_LOCK_Msk                           /*!< Lock indication. */

/******************  Bit definition for HSEM_RLR register  ********************/
#define HSEM_RLR_PROCID_Pos             (0U)
#define HSEM_RLR_PROCID_Msk             (0xFFUL << HSEM_RLR_PROCID_Pos)            /*!< 0x000000FF */
#define HSEM_RLR_PROCID                 HSEM_RLR_PROCID_Msk                       /*!< Semaphore PROCID. */
#define HSEM_RLR_LOCKID_Pos             (8U)
#define HSEM_RLR_LOCKID_Msk             (0xFUL << HSEM_RLR_LOCKID_Pos)             /*!< 0x00000F00 */
#define HSEM_RLR_LOCKID                 HSEM_RLR_LOCKID_Msk                       /*!< Semaphore LOCKID. */
#define HSEM_RLR_SEC_Pos                (12U)
#define HSEM_RLR_SEC_Msk                (0x1UL << HSEM_RLR_SEC_Pos)                /*!< 0x00001000 */
#define HSEM_RLR_SEC                    HSEM_RLR_SEC_Msk                          /*!< Semaphore secure. */
#define HSEM_RLR_PRIV_Pos               (13U)
#define HSEM_RLR_PRIV_Msk               (0x1UL << HSEM_RLR_PRIV_Pos)               /*!< 0x00002000 */
#define HSEM_RLR_PRIV                   HSEM_RLR_PRIV_Msk                         /*!< Semaphore privilege. */
#define HSEM_RLR_CFEN_Pos               (30U)
#define HSEM_RLR_CFEN_Msk               (0x1UL << HSEM_RLR_CFEN_Pos)               /*!< 0x40000000 */
#define HSEM_RLR_CFEN                   HSEM_RLR_CFEN_Msk                         /*!< Semaphore CID filter indication. */
#define HSEM_RLR_LOCK_Pos               (31U)
#define HSEM_RLR_LOCK_Msk               (0x1UL << HSEM_RLR_LOCK_Pos)               /*!< 0x80000000 */
#define HSEM_RLR_LOCK                   HSEM_RLR_LOCK_Msk                         /*!< Lock indication. */

/******************  Bit definition for HSEM_C1IER register  ******************/
#define HSEM_C1IER_ISE_Pos              (0U)
#define HSEM_C1IER_ISE_Msk              (0xFFFFUL << HSEM_C1IER_ISE_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1IER_ISE                  HSEM_C1IER_ISE_Msk                        /*!< non-secure Interrupt(n) semaphore x enable bit. (x = 0 to 15) */

#define HSEM_C1IER_ISE0_Pos             (0U)
#define HSEM_C1IER_ISE0_Msk             (0x1UL << HSEM_C1IER_ISE0_Pos)               /*!< 0x00000001 */
#define HSEM_C1IER_ISE0                 HSEM_C1IER_ISE0_Msk                          /*!<semaphore 0 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE1_Pos             (1U)
#define HSEM_C1IER_ISE1_Msk             (0x1UL << HSEM_C1IER_ISE1_Pos)               /*!< 0x00000002 */
#define HSEM_C1IER_ISE1                 HSEM_C1IER_ISE1_Msk                          /*!<semaphore 1 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE2_Pos             (2U)
#define HSEM_C1IER_ISE2_Msk             (0x1UL << HSEM_C1IER_ISE2_Pos)               /*!< 0x00000004 */
#define HSEM_C1IER_ISE2                 HSEM_C1IER_ISE2_Msk                          /*!<semaphore 2 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE3_Pos             (3U)
#define HSEM_C1IER_ISE3_Msk             (0x1UL << HSEM_C1IER_ISE3_Pos)               /*!< 0x00000008 */
#define HSEM_C1IER_ISE3                 HSEM_C1IER_ISE3_Msk                          /*!<semaphore 3 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE4_Pos             (4U)
#define HSEM_C1IER_ISE4_Msk             (0x1UL << HSEM_C1IER_ISE4_Pos)               /*!< 0x00000010 */
#define HSEM_C1IER_ISE4                 HSEM_C1IER_ISE4_Msk                          /*!<semaphore 4 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE5_Pos             (5U)
#define HSEM_C1IER_ISE5_Msk             (0x1UL << HSEM_C1IER_ISE5_Pos)               /*!< 0x00000020 */
#define HSEM_C1IER_ISE5                 HSEM_C1IER_ISE5_Msk                          /*!<semaphore 5 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE6_Pos             (6U)
#define HSEM_C1IER_ISE6_Msk             (0x1UL << HSEM_C1IER_ISE6_Pos)               /*!< 0x00000040 */
#define HSEM_C1IER_ISE6                 HSEM_C1IER_ISE6_Msk                          /*!<semaphore 6 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE7_Pos             (7U)
#define HSEM_C1IER_ISE7_Msk             (0x1UL << HSEM_C1IER_ISE7_Pos)               /*!< 0x00000080 */
#define HSEM_C1IER_ISE7                 HSEM_C1IER_ISE7_Msk                          /*!<semaphore 7 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE8_Pos             (8U)
#define HSEM_C1IER_ISE8_Msk             (0x1UL << HSEM_C1IER_ISE8_Pos)               /*!< 0x00000100 */
#define HSEM_C1IER_ISE8                 HSEM_C1IER_ISE8_Msk                          /*!<semaphore 8 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE9_Pos             (9U)
#define HSEM_C1IER_ISE9_Msk             (0x1UL << HSEM_C1IER_ISE9_Pos)               /*!< 0x00000200 */
#define HSEM_C1IER_ISE9                 HSEM_C1IER_ISE9_Msk                          /*!<semaphore 9 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE10_Pos            (10U)
#define HSEM_C1IER_ISE10_Msk            (0x1UL << HSEM_C1IER_ISE10_Pos)              /*!< 0x00000400 */
#define HSEM_C1IER_ISE10                HSEM_C1IER_ISE10_Msk                         /*!<semaphore 10 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE11_Pos            (11U)
#define HSEM_C1IER_ISE11_Msk            (0x1UL << HSEM_C1IER_ISE11_Pos)              /*!< 0x00000800 */
#define HSEM_C1IER_ISE11                HSEM_C1IER_ISE11_Msk                         /*!<semaphore 11 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE12_Pos            (12U)
#define HSEM_C1IER_ISE12_Msk            (0x1UL << HSEM_C1IER_ISE12_Pos)              /*!< 0x00001000 */
#define HSEM_C1IER_ISE12                HSEM_C1IER_ISE12_Msk                         /*!<semaphore 12 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE13_Pos            (13U)
#define HSEM_C1IER_ISE13_Msk            (0x1UL << HSEM_C1IER_ISE13_Pos)              /*!< 0x00002000 */
#define HSEM_C1IER_ISE13                HSEM_C1IER_ISE13_Msk                         /*!<semaphore 13 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE14_Pos            (14U)
#define HSEM_C1IER_ISE14_Msk            (0x1UL << HSEM_C1IER_ISE14_Pos)              /*!< 0x00004000 */
#define HSEM_C1IER_ISE14                HSEM_C1IER_ISE14_Msk                         /*!<semaphore 14 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE15_Pos            (15U)
#define HSEM_C1IER_ISE15_Msk            (0x1UL << HSEM_C1IER_ISE15_Pos)              /*!< 0x00008000 */
#define HSEM_C1IER_ISE15                HSEM_C1IER_ISE15_Msk                         /*!<semaphore 15 interrupt 0 enable bit. */

/******************  Bit definition for HSEM_C1ICR register  ******************/
#define HSEM_C1ICR_ISC_Pos              (0U)
#define HSEM_C1ICR_ISC_Msk              (0xFFFFUL << HSEM_C1ICR_ISC_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1ICR_ISC                  HSEM_C1ICR_ISC_Msk                        /*!< non-secure Interrupt(n) semaphore x clear bit. (x = 0 to 15) */

/******************  Bit definition for HSEM_C1ISR register  ******************/
#define HSEM_C1ISR_ISF_Pos              (0U)
#define HSEM_C1ISR_ISF_Msk              (0xFFFFUL << HSEM_C1ISR_ISF_Pos)           /*!< 0x0000FFFF */
#define HSEM_C1ISR_ISF                  HSEM_C1ISR_ISF_Msk                        /*!< non-secure Interrupt(n) semaphore x status bit before enable (mask). (x = 0 to 15) */

/*****************  Bit definition for HSEM_C1MISR register  ******************/
#define HSEM_C1MISR_MISF_Pos            (0U)
#define HSEM_C1MISR_MISF_Msk            (0xFFFFUL << HSEM_C1MISR_MISF_Pos)         /*!< 0x0000FFFF */
#define HSEM_C1MISR_MISF                HSEM_C1MISR_MISF_Msk                      /*!< masked non-secure interrupt(n) semaphore x status bit after enable (mask). (x = 0 to 15) */

