STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_cm33.h
/* Bit fields for USB3_DCFG register */
#define USB3_DCFG_DEVSPD_Pos                 0
#define USB3_DCFG_DEVSPD_Msk                 (0x7UL << 0)
#define USB3_DCFG_DEVSPD                     (0x7UL << 0)
#define USB3_DCFG_DEVADDR_Pos                3
#define USB3_DCFG_DEVADDR_Msk                (0x7fUL << 3)
#define USB3_DCFG_DEVADDR                    (0x7fUL << 3)
#define USB3_DCFG_INTRNUM_Pos                12
#define USB3_DCFG_INTRNUM_Msk                (0x1fUL << 12)
#define USB3_DCFG_INTRNUM                    (0x1fUL << 12)
#define USB3_DCFG_NUMP_Pos                   17
#define USB3_DCFG_NUMP_Msk                   (0x1fUL << 17)
#define USB3_DCFG_NUMP                       (0x1fUL << 17)
#define USB3_DCFG_LPMCAP_Pos                 22
#define USB3_DCFG_LPMCAP_Msk                 (0x1UL << 22)
#define USB3_DCFG_LPMCAP                     (0x1UL << 22)
#define USB3_DCFG_IgnStrmPP_Pos              23
#define USB3_DCFG_IgnStrmPP_Msk              (0x1UL << 23)
#define USB3_DCFG_IgnStrmPP                  (0x1UL << 23)

/* Bit fields for USB3_DCTL register */
#define USB3_DCTL_TSTCTL_Pos                 1
#define USB3_DCTL_TSTCTL_Msk                 (0xfUL << 1)
#define USB3_DCTL_TSTCTL                     (0xfUL << 1)
#define USB3_DCTL_ULSTCHNGREQ_Pos            5
#define USB3_DCTL_ULSTCHNGREQ_Msk            (0xfUL << 5)
#define USB3_DCTL_ULSTCHNGREQ                (0xfUL << 5)
#define USB3_DCTL_ACCEPTU1ENA_Pos            9
#define USB3_DCTL_ACCEPTU1ENA_Msk            (0x1UL << 9)
#define USB3_DCTL_ACCEPTU1ENA                (0x1UL << 9)
#define USB3_DCTL_INITU1ENA_Pos              10
#define USB3_DCTL_INITU1ENA_Msk              (0x1UL << 10)
#define USB3_DCTL_INITU1ENA                  (0x1UL << 10)
#define USB3_DCTL_ACCEPTU2ENA_Pos            11
#define USB3_DCTL_ACCEPTU2ENA_Msk            (0x1UL << 11)
#define USB3_DCTL_ACCEPTU2ENA                (0x1UL << 11)
#define USB3_DCTL_INITU2ENA_Pos              12
#define USB3_DCTL_INITU2ENA_Msk              (0x1UL << 12)
#define USB3_DCTL_INITU2ENA                  (0x1UL << 12)
#define USB3_DCTL_CSS_Pos                    16
#define USB3_DCTL_CSS_Msk                    (0x1UL << 16)
#define USB3_DCTL_CSS                        (0x1UL << 16)
#define USB3_DCTL_CRS_Pos                    17
#define USB3_DCTL_CRS_Msk                    (0x1UL << 17)
#define USB3_DCTL_CRS                        (0x1UL << 17)
#define USB3_DCTL_L1HibernationEn_Pos        18
#define USB3_DCTL_L1HibernationEn_Msk        (0x1UL << 18)
#define USB3_DCTL_L1HibernationEn            (0x1UL << 18)
#define USB3_DCTL_KeepConnect_Pos            19
#define USB3_DCTL_KeepConnect_Msk            (0x1UL << 19)
#define USB3_DCTL_KeepConnect                (0x1UL << 19)
#define USB3_DCTL_LPM_NYET_thres_Pos         20
#define USB3_DCTL_LPM_NYET_thres_Msk         (0xfUL << 20)
#define USB3_DCTL_LPM_NYET_thres             (0xfUL << 20)
#define USB3_DCTL_HIRDTHRES_Pos              24
#define USB3_DCTL_HIRDTHRES_Msk              (0x1fUL << 24)
#define USB3_DCTL_HIRDTHRES                  (0x1fUL << 24)
#define USB3_DCTL_CSFTRST_Pos                30
#define USB3_DCTL_CSFTRST_Msk                (0x1UL << 30)
#define USB3_DCTL_CSFTRST                    (0x1UL << 30)
#define USB3_DCTL_RUN_STOP_Pos               31
#define USB3_DCTL_RUN_STOP_Msk               (0x1UL << 31)
#define USB3_DCTL_RUN_STOP                   (0x1UL << 31)

/* Bit fields for USB3_DEVTEN register */
#define USB3_DEVTEN_DISSCONNEVTEN_Pos        0
#define USB3_DEVTEN_DISSCONNEVTEN_Msk        (0x1UL << 0)
#define USB3_DEVTEN_DISSCONNEVTEN            (0x1UL << 0)
#define USB3_DEVTEN_USBRSTEVTEN_Pos          1
#define USB3_DEVTEN_USBRSTEVTEN_Msk          (0x1UL << 1)
#define USB3_DEVTEN_USBRSTEVTEN              (0x1UL << 1)
#define USB3_DEVTEN_CONNECTDONEEVTEN_Pos     2
#define USB3_DEVTEN_CONNECTDONEEVTEN_Msk     (0x1UL << 2)
#define USB3_DEVTEN_CONNECTDONEEVTEN         (0x1UL << 2)
#define USB3_DEVTEN_ULSTCNGEN_Pos            3
#define USB3_DEVTEN_ULSTCNGEN_Msk            (0x1UL << 3)
#define USB3_DEVTEN_ULSTCNGEN                (0x1UL << 3)
#define USB3_DEVTEN_WKUPEVTEN_Pos            4
#define USB3_DEVTEN_WKUPEVTEN_Msk            (0x1UL << 4)
#define USB3_DEVTEN_WKUPEVTEN                (0x1UL << 4)
#define USB3_DEVTEN_HibernationReqEvtEn_Pos  5
#define USB3_DEVTEN_HibernationReqEvtEn_Msk  (0x1UL << 5)
#define USB3_DEVTEN_HibernationReqEvtEn      (0x1UL << 5)
#define USB3_DEVTEN_U3L2L1SuspEn_Pos         6
#define USB3_DEVTEN_U3L2L1SuspEn_Msk         (0x1UL << 6)
#define USB3_DEVTEN_U3L2L1SuspEn             (0x1UL << 6)
#define USB3_DEVTEN_SOFTEVTEN_Pos            7
#define USB3_DEVTEN_SOFTEVTEN_Msk            (0x1UL << 7)
#define USB3_DEVTEN_SOFTEVTEN                (0x1UL << 7)
#define USB3_DEVTEN_L1SUSPEN_Pos             8
#define USB3_DEVTEN_L1SUSPEN_Msk             (0x1UL << 8)
#define USB3_DEVTEN_L1SUSPEN                 (0x1UL << 8)
#define USB3_DEVTEN_ERRTICERREVTEN_Pos       9
#define USB3_DEVTEN_ERRTICERREVTEN_Msk       (0x1UL << 9)
#define USB3_DEVTEN_ERRTICERREVTEN           (0x1UL << 9)
#define USB3_DEVTEN_CMDCMPLTEN_Pos           10
#define USB3_DEVTEN_CMDCMPLTEN_Msk           (0x1UL << 10)
#define USB3_DEVTEN_CMDCMPLTEN               (0x1UL << 10)
#define USB3_DEVTEN_EVNTOVERFLOWEN_Pos       11
#define USB3_DEVTEN_EVNTOVERFLOWEN_Msk       (0x1UL << 11)
#define USB3_DEVTEN_EVNTOVERFLOWEN           (0x1UL << 11)
#define USB3_DEVTEN_VENDEVTSTRCVDEN_Pos      12
#define USB3_DEVTEN_VENDEVTSTRCVDEN_Msk      (0x1UL << 12)
#define USB3_DEVTEN_VENDEVTSTRCVDEN          (0x1UL << 12)
#define USB3_DEVTEN_L1WKUPEVTEN_Pos          14
#define USB3_DEVTEN_L1WKUPEVTEN_Msk          (0x1UL << 14)
#define USB3_DEVTEN_L1WKUPEVTEN              (0x1UL << 14)
#define USB3_DEVTEN_ECCERREN_Pos             16
#define USB3_DEVTEN_ECCERREN_Msk             (0x1UL << 16)
#define USB3_DEVTEN_ECCERREN                 (0x1UL << 16)

/* Bit fields for USB3_DSTS register */
#define USB3_DSTS_CONNECTSPD_Pos             0
#define USB3_DSTS_CONNECTSPD_Msk             (0x7UL << 0)
#define USB3_DSTS_CONNECTSPD                 (0x7UL << 0)
#define USB3_DSTS_SOFFN_Pos                  3
#define USB3_DSTS_SOFFN_Msk                  (0x3fffUL << 3)
#define USB3_DSTS_SOFFN                      (0x3fffUL << 3)
#define USB3_DSTS_RXFIFOEMPTY_Pos            17
#define USB3_DSTS_RXFIFOEMPTY_Msk            (0x1UL << 17)
#define USB3_DSTS_RXFIFOEMPTY                (0x1UL << 17)
#define USB3_DSTS_USBLNKST_Pos               18
#define USB3_DSTS_USBLNKST_Msk               (0xfUL << 18)
#define USB3_DSTS_USBLNKST                   (0xfUL << 18)
#define USB3_DSTS_DEVCTRLHLT_Pos             22
#define USB3_DSTS_DEVCTRLHLT_Msk             (0x1UL << 22)
#define USB3_DSTS_DEVCTRLHLT                 (0x1UL << 22)
#define USB3_DSTS_COREIDLE_Pos               23
#define USB3_DSTS_COREIDLE_Msk               (0x1UL << 23)
#define USB3_DSTS_COREIDLE                   (0x1UL << 23)
#define USB3_DSTS_SSS_Pos                    24
#define USB3_DSTS_SSS_Msk                    (0x1UL << 24)
#define USB3_DSTS_SSS                        (0x1UL << 24)
#define USB3_DSTS_RSS_Pos                    25
#define USB3_DSTS_RSS_Msk                    (0x1UL << 25)
#define USB3_DSTS_RSS                        (0x1UL << 25)
#define USB3_DSTS_SRE_Pos                    28
#define USB3_DSTS_SRE_Msk                    (0x1UL << 28)
#define USB3_DSTS_SRE                        (0x1UL << 28)
#define USB3_DSTS_DCNRD_Pos                  29
#define USB3_DSTS_DCNRD_Msk                  (0x1UL << 29)
#define USB3_DSTS_DCNRD                      (0x1UL << 29)

/* Bit fields for USB3_DGCMDPAR register */
#define USB3_DGCMDPAR_PARAMETER_Pos          0
#define USB3_DGCMDPAR_PARAMETER_Msk          (0xFFFFFFFFUL << 0)
#define USB3_DGCMDPAR_PARAMETER              (0xFFFFFFFFUL << 0)

