STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233cxx_cm33.h
/* Bit fields for USB3_DGCMD register */
#define USB3_DGCMD_CMDTYP_Pos                0
#define USB3_DGCMD_CMDTYP_Msk                (0xffUL << 0)
#define USB3_DGCMD_CMDTYP                    (0xffUL << 0)
#define USB3_DGCMD_CMDIOC_Pos                8
#define USB3_DGCMD_CMDIOC_Msk                (0x1UL << 8)
#define USB3_DGCMD_CMDIOC                    (0x1UL << 8)
#define USB3_DGCMD_CMDACT_Pos                10
#define USB3_DGCMD_CMDACT_Msk                (0x1UL << 10)
#define USB3_DGCMD_CMDACT                    (0x1UL << 10)
#define USB3_DGCMD_CMDSTATUS_Pos             12
#define USB3_DGCMD_CMDSTATUS_Msk             (0xfUL << 12)
#define USB3_DGCMD_CMDSTATUS                 (0xfUL << 12)

/* Bit fields for USB3_DALEPENA register */
#define USB3_DALEPENA_USBACTEP_Pos           0
#define USB3_DALEPENA_USBACTEP_Msk           (0xFFFFFFFFUL << 0)
#define USB3_DALEPENA_USBACTEP               (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_Rsvd register */

/* Bit fields for USB3_DEPCMDPAR2 register */
#define USB3_DEPCMDPAR2_PARAMETER_Pos        0
#define USB3_DEPCMDPAR2_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR2_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMDPAR1 register */
#define USB3_DEPCMDPAR1_PARAMETER_Pos        0
#define USB3_DEPCMDPAR1_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR1_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMDPAR0 register */
#define USB3_DEPCMDPAR0_PARAMETER_Pos        0
#define USB3_DEPCMDPAR0_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR0_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMD register */
#define USB3_DEPCMD_CMDTYP_Pos               0
#define USB3_DEPCMD_CMDTYP_Msk               (0xfUL << 0)
#define USB3_DEPCMD_CMDTYP                   (0xfUL << 0)
#define USB3_DEPCMD_CMDIOC_Pos               8
#define USB3_DEPCMD_CMDIOC_Msk               (0x1UL << 8)
#define USB3_DEPCMD_CMDIOC                   (0x1UL << 8)
#define USB3_DEPCMD_CMDACT_Pos               10
#define USB3_DEPCMD_CMDACT_Msk               (0x1UL << 10)
#define USB3_DEPCMD_CMDACT                   (0x1UL << 10)
#define USB3_DEPCMD_HIPRI_FORCERM_Pos        11
#define USB3_DEPCMD_HIPRI_FORCERM_Msk        (0x1UL << 11)
#define USB3_DEPCMD_HIPRI_FORCERM            (0x1UL << 11)
#define USB3_DEPCMD_CMDSTATUS_Pos            12
#define USB3_DEPCMD_CMDSTATUS_Msk            (0xfUL << 12)
#define USB3_DEPCMD_CMDSTATUS                (0xfUL << 12)
#define USB3_DEPCMD_COMMANDPARAM_Pos         16
#define USB3_DEPCMD_COMMANDPARAM_Msk         (0xffffUL << 16)
#define USB3_DEPCMD_COMMANDPARAM             (0xffffUL << 16)

/* Bit fields for USB3_DEV_IMOD register */
#define USB3_DEV_IMOD_DEVICE_IMODI_Pos       0
#define USB3_DEV_IMOD_DEVICE_IMODI_Msk       (0xffffUL << 0)
#define USB3_DEV_IMOD_DEVICE_IMODI           (0xffffUL << 0)
#define USB3_DEV_IMOD_DEVICE_IMODC_Pos       16
#define USB3_DEV_IMOD_DEVICE_IMODC_Msk       (0xffffUL << 16)
#define USB3_DEV_IMOD_DEVICE_IMODC           (0xffffUL << 16)

/* Bit fields for USB3_BCFG register */
#define USB3_BCFG_CHIRP_EN_Pos           0
#define USB3_BCFG_CHIRP_EN_Msk           (0x1UL << 0)
#define USB3_BCFG_CHIRP_EN               (0x1UL << 0)
#define USB3_BCFG_IDDIG_SEL_Pos          1
#define USB3_BCFG_IDDIG_SEL_Msk          (0x1UL << 1)
#define USB3_BCFG_IDDIG_SEL              (0x1UL << 1)

/* Bit fields for USB3_BCEVT register */
#define USB3_BCEVT_MultValIdBc_Pos       0
#define USB3_BCEVT_MultValIdBc_Msk       (0x1fUL << 0)
#define USB3_BCEVT_MultValIdBc           (0x1fUL << 0)
#define USB3_BCEVT_MV_ChngEvnt_Pos       24
#define USB3_BCEVT_MV_ChngEvnt_Msk       (0x1UL << 24)
#define USB3_BCEVT_MV_ChngEvnt           (0x1UL << 24)

/* Bit fields for USB3_BCEVTEN register */
#define USB3_BCEVTEN_MV_ChngEvntEna_Pos  24
#define USB3_BCEVTEN_MV_ChngEvntEna_Msk  (0x1UL << 24)
#define USB3_BCEVTEN_MV_ChngEvntEna      (0x1UL << 24)


/***********  Bit definition for USB3_LU1LFPSRXTIM register  ***********/
#define USB3_LU1LFPSRXTIM_U1U2_EXIT_RSP_RX_CLK_Pos                    (0U)
#define USB3_LU1LFPSRXTIM_U1U2_EXIT_RSP_RX_CLK_Msk                    (0xFFUL << USB3_LU1LFPSRXTIM_U1U2_EXIT_RSP_RX_CLK_Pos)      /*!< 0x000000FF */
#define USB3_LU1LFPSRXTIM_U1U2_EXIT_RSP_RX_CLK                        USB3_LU1LFPSRXTIM_U1U2_EXIT_RSP_RX_CLK_Msk                 /*!< Programmable U1U2 EXIT RESP RX CLKS */
#define USB3_LU1LFPSRXTIM_U1U2_LFPS_EXIT_RX_CLK_Pos                   (8U)
#define USB3_LU1LFPSRXTIM_U1U2_LFPS_EXIT_RX_CLK_Msk                   (0xFFUL << USB3_LU1LFPSRXTIM_U1U2_LFPS_EXIT_RX_CLK_Pos)     /*!< 0x0000FF00 */
#define USB3_LU1LFPSRXTIM_U1U2_LFPS_EXIT_RX_CLK                       USB3_LU1LFPSRXTIM_U1U2_LFPS_EXIT_RX_CLK_Msk                /*!< Programmable U1U2 LFPS EXIT RX CLKS */

/*************  Bit definition for USB3_SETTINGS register  *************/
#define USB3_SETTINGS_PM_ENTRY_TIMER_US_Pos                           (20U)
#define USB3_SETTINGS_PM_ENTRY_TIMER_US_Msk                           (0xFUL << USB3_SETTINGS_PM_ENTRY_TIMER_US_Pos)              /*!< 0x00F00000 */
#define USB3_SETTINGS_PM_ENTRY_TIMER_US                               USB3_SETTINGS_PM_ENTRY_TIMER_US_Msk                        /*!< Programmable PM_ENTRY_TIMER */
#define USB3_SETTINGS_PM_LC_TIMER_US_Pos                              (24U)
#define USB3_SETTINGS_PM_LC_TIMER_US_Msk                              (0x7UL << USB3_SETTINGS_PM_LC_TIMER_US_Pos)                 /*!< 0x07000000 */
#define USB3_SETTINGS_PM_LC_TIMER_US                                  USB3_SETTINGS_PM_LC_TIMER_US_Msk                           /*!< Programmable PM_LC_TIMER */
#define USB3_SETTINGS_U1_RESID_TIMER_US_Pos                           (28U)
#define USB3_SETTINGS_U1_RESID_TIMER_US_Msk                           (0x7UL << USB3_SETTINGS_U1_RESID_TIMER_US_Pos)              /*!< 0x70000000 */
#define USB3_SETTINGS_U1_RESID_TIMER_US                               USB3_SETTINGS_U1_RESID_TIMER_US_Msk                        /*!< Programmable U1 MIN RESIDENCY TIMER */

